tests/load/ingestion-load.yml
# DataFlux Load Testing Configuration
# Artillery.js configuration for performance testing

config:
  target: 'http://localhost:2013'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 5
      name: "Cool down"
  defaults:
    headers:
      Content-Type: 'application/json'
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Asset Upload"
    weight: 30
    flow:
      - post:
          url: "/api/v1/assets"
          formData:
            file: "@test-image.jpg"
            context: "Load test upload"
            priority: "5"
          expect:
            - statusCode: 200
            - hasProperty: "asset_id"

  - name: "Search Assets"
    weight: 25
    flow:
      - post:
          url: "/api/v1/search"
          json:
            query: "test search {{ $randomString() }}"
            media_type: "all"
            limit: 10
            offset: 0
          expect:
            - statusCode: 200
            - hasProperty: "results"

  - name: "Get Asset Details"
    weight: 15
    flow:
      - get:
          url: "/api/v1/assets/{{ $randomString() }}"
          expect:
            - statusCode: [200, 404]

  - name: "Similar Assets"
    weight: 10
    flow:
      - post:
          url: "/api/v1/similar"
          json:
            asset_id: "{{ $randomString() }}"
            limit: 5
          expect:
            - statusCode: [200, 404]